# 依頼語彙
REQUEST_WORDS = [
    "お願い", "頼む", "頼みたい", "してほしい",
    "ください", "くれる？", "もらえる？",
    "起こして", "取って", "行って","来て"
]

# 行為語彙（実行報告・実行結果）
ACTION_WORDS = [
    "した", "やった", "渡した", "起こした",
    "行った", "伝えた", "実行した"
]

# 逆接
CONTRAST_WORDS = [
    "けど", "けれど", "でも", "しかし", "なのに"
]

# ポジティブ語彙（成功）
POSITIVE_WORDS = [
    "合ってた", "うまくいった", "成功",
    "よかった", "大丈夫だった", "問題なかった"
]

# 時間参照語
TIME_REFERENCE = [
    "30分後", "あとで", "明日", "朝", "夕方",
    "今から", "その後"
]

# 視点依存語
PERSPECTIVE_WORDS = [
    "右", "左", "向かい", "手前", "奥",
    "前", "後ろ"
]

# 指示語
DEICTIC_WORDS = [
    "これ", "それ", "あれ",
    "この", "その", "あの"
]